import React from "react";
import { useContext } from "react";
import { Link } from "react-router-dom";
import { AuthContext } from "./Auth";
import './Home.css';
import firebaseConfig from "../config";


const Home=()=>{

    
    return (
        <div>
            <div className="header">
                <div className="header-container">
                    <div className="header-con">
                        <div className="logo-container">
                            <a href="#">Lets We Help</a>
                        </div>
                        <ul className="menu">
                            <li className="menu-link">
                                <a href="#">HOME</a>
                            </li>
                            <li className="menu-link">
                                <a href="#">QUIZ</a>
                            </li>
                            <li className="menu-link">
                                <butt><Link to="/login">LOGIN</Link></butt>
                            </li>
                            <li className="menu-link">
                                <Link to="/signup">SIGNUP</Link>
                            </li>
                            <li className="menu-link">
                                <button onClick={()=>firebaseConfig.auth().signOut()}>SignOut</button>
                            </li>
                        </ul>
                    </div>
                </div>
            </div>
            
            <div className="banner-bg">
                <div className="banner-container">
                    <div className="banner-con">
                        <div className="banner-text">
                            <h1>ยินดีต้อนรับ</h1>
                            <p>
                            เว็บไซต์นี้จัดทำเพื่อช่วยเหลือผู้ที่มีแนวโน้มหรือเป็นโรคซึมเศร้า โดยเว็บไซต์นี้จะเป็นสื่อให้ความรู้เกี่ยวกับโรคซึมเศร้า ร่วมทั้งมีแบบประเมินสภาพจิตให้ได้ทำการทดสอบ สามารถรู้ผลได้ทันทีหลังจากประเมิน และยังมีระบบที่จะเพิ่มขึ้นอีกเร็วๆนี้
                            </p>
                            <a href="#" className="banner-btn">เริ่มทำแบบทดสอบ</a>
                        </div>
                    </div>
                </div>
            </div>
            
            <div className="content-container">
            <section className="content-con">
                <div className="content-l">
                    <img src="https://images.unsplash.com/photo-1581691859760-8154bf4011ec?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=1050&q=80" alt=""/>
                </div>
                <div className="content-r">
                    <h2>โรคซึมเศร้าคืออะไร </h2>
                    <p>
                    โรคซึมเศร้าเกิดจากความผิดปกติของการหลั่งสารเคมีในสมองที่มีผลกระทบต่อความคิด อารมณ์ ความรู้สึก พฤติกรรม รวมถึงสุขภาพทางกาย 
                    โดยโรคซึมเศร้าเป็นโรคที่เกิดจากความไม่สมดุลของสารสื่อประสาท 3 ชนิด คือ ซีโรโตนิน (serotonin)  เอพิเนฟริน (norepinephrine) และ โดปามีน (Dopamine) 
                    ทำให้พฤติกรรมของผู้ป่วยเปลี่ยนไปจนส่งผลกระทบต่อการใช้ชีวิตประจำวัน กลายเป็นคนมองโลกในแง่ลบ เศร้า หม่นหมอง หดหู่ เก็บเนื้อเก็บตัว รู้สึกเบื่อหน่ายกับสิ่งที่เคยสนุกหรือสบายใจ ไม่มีความสุข
                    </p>
                </div>
            </section>    
            <section className="content-con">
                <div className="content-l"> 
                    <h2>สาเหตุของการเกิดอาการโรคซึมเศร้า </h2>
                    <p>โรคซึมเศร้าอาจเกิดได้จากหลายสาเหตุและปัจจัยประกอบกัน </p>
                    <p>• ด้านกรรมพันธุ์ หรือพื้นฐานดั้งเดิม โดยมีสมาชิกในครอบครัวเป็นโรคซึมเศร้าส่งผลให้มีโอกาสป่วยเป็นโรคนี้มากกว่าคนทั่วไป 2-3 เท่า </p>
                    <p>• สารเคมีในสมอง ความผิดปกติของการหลั่งสารเคมีในสมอง โดยมีสารที่สำคัญได้แก่ ซีโรโทนิน (serotonin) นอร์เอพิเนฟริน (norepinephrine) 
                        และ โดปามีน (Dopamine)  ลดต่ำลง รวมทั้งอาจมีความผิดปกติของเซลล์รับสื่อเคมีเหล่านี้</p>
                    <p>• ลักษณะนิสัยที่เอื้อต่อการเผชิญภาวะซึมเศร้า อย่างเช่น การมองตัวเองในแง่ลบ ความรู้สึกในทางลบหรือไม่สามารถจัดการความเครียดของตัวเองได้</p>
                    <p>• เหตุการณ์ที่ทำให้ตึงเครียดหรือมีผลกระทบกระเทือนทางจิตใจอย่างรุนแรง</p></div>
                <div className="content-r">
                    <img src="https://images.unsplash.com/photo-1496262967815-132206202600?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=1095&q=80" alt=""/>
                </div>
            </section> 
            <section className="content-con">
                <div className="content-l">
                    <img src="https://images.unsplash.com/photo-1446511437394-36cdff3ae1b3?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=1050&q=80" alt=""/>
                </div>
                <div className="content-r">
                    <h2>ประเภทของโรคซึมเศร้า </h2>
                    <p>โรคซึมเศร้ามีหลายประเภท ทำให้ผู้ป่วยซึมเศร้าแต่ละคนมีพฤติกรรมที่แตกต่างกันออกไป โดยส่วนมากจะพบเห็นได้บ่อยอยู่ 4 ประเภท เช่น</p>
                    <p><b>โรคซึมเศร้าแบบเมเจอร์ ดีเพรสชั่น (Major Depression)</b>โรคซึมเศร้าชนิดนี้ ผู้ป่วยจะมีอารมณ์ซึมเศร้านานกว่า 2 สัปดาห์ 
                        โดยมากมักมีอาการเศร้าซึมมากจนไม่มีความสุขหรือไม่สนใจในสิ่งต่างๆ ที่เคยชอบ หลับยาก น้ำหนักขึ้นหรือลงฮวบฮาบ รู้สึกหงุดหงิด เหนื่อยๆ เนือยๆ ไม่มีเรี่ยวแรง รู้สึกไร้ค่า 
                        ช่วงภาวะซึมเศร้านี้สามารถเกิดในช่วงหลังคลอดได้ และมีอาการหลง หูแว่วประสาทหลอนเกิดขึ้นร่วมด้วย ดังนั้นควรเริ่มรักษาตั้งแต่เนิ่นๆ เพื่อไม่ให้โรครุนแรงขึ้น และลดความเสี่ยงต่อการฆ่าตัวตายที่อาจจะเกิดขึ้นได้</p>
                    <p><b>โรคซึมเศร้าแบบดิสทีเมีย (Dysthymia Depression)</b>โรคซึมเศร้าชนิดนี้ ผู้ป่วยจะมีอาการรุนแรงน้อยกว่าชนิด เมเจอร์ ดีเพรสชั่น แต่จะมีอาการอย่างต่อเนื่องอย่างน้อย 2 ปี 
                        อาการไม่รุนแรงถึงขนาดทำอะไรไม่ได้ เพียงแต่จะรู้สึกไม่อยากอาหารหรือกินมากไป นอนไม่หลับหรือนอนมากไป เหนื่อยล้า อ่อนเพลีย หมดแรง ขาดความมั่นใจในตัวเอง ไม่ค่อยมีสมาธิ การตัดสินใจแย่ลง และรู้สึกหมดหวัง </p>
                    <p><b>โรคซึมเศร้าที่เกิดขึ้นก่อนมีระดู  (Premenstrual depressive disorder)</b>ผู้ป่วยจะมีอาการเกิดขึ้นในสัปดาห์สุดท้ายก่อนมีระดู  
                        อาการจะดีขึ้นใน 2-3 วันหลังจากมีระดู อาการที่พบบ่อย  คือ  อารมณ์แกว่ง  รู้สึกเศร้า  อ่อนไหวง่าย  ขัดแย้งกับคนอื่นง่าย  รู้สึกสิ้นหวัง ดูถูกตนเอง  
                        อาจมีอาการวิตกกังวล เครียด นั่งไม่ติด สมาธิลดลง  รู้สึกล้า อ่อนเพลีย  ไม่อยากทำอะไร  ความอยากอาหารเปลี่ยนแปลง  การนอนผิดปกติไปจากเดิม  
                        และมีอาการทางร่างกายร่วมด้วย  เช่น  เจ็บเต้านม  เต้านมบวม  ปวดข้อปวดกล้ามเนื้อ  ตัวบวมขึ้น </p>
                    <p><b>โรคซึมเศร้าแบบไบโพรา (bipolar disorder)</b>หรือที่เรียกว่า manic-depressive illness  
                        ผู้ป่วยจะมีการเปลี่ยนแปลงทางอารมณ์ซึ่งบางคนอาจจะเปลี่ยนแปลงอย่างรวดเร็ว ส่วนมากจะค่อยเป็นค่อยไป 
                        เวลาซึมเศร้าจะมีอาการมากบ้างน้อยบ้าง แต่เมื่อเปลี่ยนเป็นช่วงอารมณ์ mania ผู้ป่วยจะพูดมาก  กระฉับกระเฉงมากเกินกว่าเหตุ 
                        มีพลังงานเหลือเฟือ ในช่วง mania จะมีผลกระทบต่อความคิด การตัดสินใจและพฤติกรรมผู้ป่วยอาจจะหลงผิดขั้นรุนแรง</p>
                </div>
            </section>         
            </div>

            <div className="cta-bg">
            <div className="overlay"></div>
            <div className="container">
                <div className="cta-text">
                    <h2>กังวลอยู่หรือเปล่า?</h2>
                    <p>ถ้าหากรู้สึกว่าตนเองมีอากาศดังที่ข้อมูลที่เราได้เสนอไปนั้น 
                        คุณสามารถเช็คได้โดยการทำแบบทดสอบของเรา เพื่อที่จะเช็คได้นะ 
                        เราจะช่วยเหลือคุณเพิ่มอีกด้วย!</p>
                        <a href="#" className="cta-btn">เริ่มทำแบบทดสอบกันเลย</a>
                </div>
            </div>
            </div>

            <div className="footer">
                <p>จัดทำเมื่อ 2021. เพื่อการทำโปรเจคมหาวิทยาลัย</p>
            </div>
        </div>
    )
}

export default Home;
